bindMountResults/iothreads_2_pipeline_10_connections_512_payload_3_threads_12.txt
====== SET ======
  1000290 requests completed in 1.19 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1.6 milliseconds
0.00% <= 3 milliseconds
0.17% <= 4 milliseconds
9.68% <= 5 milliseconds
76.99% <= 6 milliseconds
90.78% <= 7 milliseconds
93.21% <= 8 milliseconds
94.10% <= 9 milliseconds
95.14% <= 10 milliseconds
97.16% <= 11 milliseconds
98.50% <= 12 milliseconds
99.36% <= 13 milliseconds
99.49% <= 19 milliseconds
99.53% <= 20 milliseconds
99.59% <= 21 milliseconds
99.65% <= 22 milliseconds
99.73% <= 23 milliseconds
99.81% <= 24 milliseconds
99.88% <= 25 milliseconds
99.95% <= 26 milliseconds
99.99% <= 34 milliseconds
100.00% <= 34 milliseconds
839874.06 requests per second

====== GET ======
  1000350 requests completed in 1.06 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.02% <= 3 milliseconds
1.03% <= 4 milliseconds
58.70% <= 5 milliseconds
91.12% <= 6 milliseconds
93.59% <= 7 milliseconds
94.10% <= 8 milliseconds
95.43% <= 9 milliseconds
97.99% <= 10 milliseconds
99.07% <= 11 milliseconds
99.31% <= 12 milliseconds
99.39% <= 13 milliseconds
99.45% <= 14 milliseconds
99.49% <= 16 milliseconds
99.53% <= 17 milliseconds
99.68% <= 18 milliseconds
99.74% <= 25 milliseconds
99.76% <= 26 milliseconds
99.81% <= 27 milliseconds
99.90% <= 28 milliseconds
99.93% <= 29 milliseconds
99.94% <= 30 milliseconds
99.99% <= 31 milliseconds
100.00% <= 31 milliseconds
943726.44 requests per second

====== HSET ======
  1000430 requests completed in 1.40 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.01% <= 2 milliseconds
0.02% <= 3 milliseconds
0.02% <= 4 milliseconds
0.20% <= 5 milliseconds
21.63% <= 6 milliseconds
71.12% <= 7 milliseconds
89.07% <= 8 milliseconds
92.36% <= 9 milliseconds
94.26% <= 10 milliseconds
95.58% <= 11 milliseconds
96.58% <= 12 milliseconds
97.76% <= 13 milliseconds
98.55% <= 14 milliseconds
98.94% <= 15 milliseconds
99.01% <= 16 milliseconds
99.04% <= 17 milliseconds
99.13% <= 18 milliseconds
99.23% <= 19 milliseconds
99.39% <= 20 milliseconds
99.65% <= 21 milliseconds
99.77% <= 22 milliseconds
99.80% <= 29 milliseconds
99.80% <= 36 milliseconds
99.83% <= 37 milliseconds
99.91% <= 38 milliseconds
99.95% <= 39 milliseconds
99.98% <= 40 milliseconds
100.00% <= 40 milliseconds
715615.19 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  1000700 requests completed in 1.32 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.04% <= 4 milliseconds
0.83% <= 5 milliseconds
40.35% <= 6 milliseconds
78.66% <= 7 milliseconds
93.35% <= 8 milliseconds
94.27% <= 9 milliseconds
95.08% <= 10 milliseconds
95.89% <= 11 milliseconds
97.30% <= 12 milliseconds
98.32% <= 13 milliseconds
99.10% <= 14 milliseconds
99.32% <= 15 milliseconds
99.47% <= 16 milliseconds
99.47% <= 18 milliseconds
99.48% <= 19 milliseconds
99.52% <= 20 milliseconds
99.58% <= 21 milliseconds
99.65% <= 22 milliseconds
99.71% <= 23 milliseconds
99.78% <= 24 milliseconds
99.85% <= 25 milliseconds
99.94% <= 26 milliseconds
99.95% <= 34 milliseconds
99.96% <= 36 milliseconds
99.98% <= 37 milliseconds
100.00% <= 37 milliseconds
758680.81 requests per second

====== LRANGE_100 (first 100 elements) ======
  1000590 requests completed in 11.27 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 23 milliseconds
0.01% <= 24 milliseconds
0.01% <= 25 milliseconds
0.02% <= 26 milliseconds
0.02% <= 27 milliseconds
0.02% <= 28 milliseconds
0.03% <= 29 milliseconds
0.03% <= 34 milliseconds
0.03% <= 35 milliseconds
0.04% <= 36 milliseconds
0.04% <= 37 milliseconds
0.05% <= 38 milliseconds
0.05% <= 39 milliseconds
0.06% <= 40 milliseconds
0.06% <= 41 milliseconds
0.06% <= 42 milliseconds
0.08% <= 43 milliseconds
0.15% <= 44 milliseconds
0.52% <= 45 milliseconds
1.55% <= 46 milliseconds
3.48% <= 47 milliseconds
6.53% <= 48 milliseconds
10.92% <= 49 milliseconds
16.81% <= 50 milliseconds
24.08% <= 51 milliseconds
32.83% <= 52 milliseconds
42.92% <= 53 milliseconds
53.94% <= 54 milliseconds
64.94% <= 55 milliseconds
74.99% <= 56 milliseconds
83.19% <= 57 milliseconds
89.07% <= 58 milliseconds
92.76% <= 59 milliseconds
95.19% <= 60 milliseconds
96.76% <= 61 milliseconds
97.79% <= 62 milliseconds
98.46% <= 63 milliseconds
98.87% <= 64 milliseconds
99.13% <= 65 milliseconds
99.29% <= 66 milliseconds
99.42% <= 67 milliseconds
99.51% <= 68 milliseconds
99.57% <= 69 milliseconds
99.59% <= 70 milliseconds
99.59% <= 71 milliseconds
99.60% <= 72 milliseconds
99.61% <= 73 milliseconds
99.62% <= 74 milliseconds
99.63% <= 75 milliseconds
99.63% <= 77 milliseconds
99.63% <= 82 milliseconds
99.64% <= 83 milliseconds
99.67% <= 84 milliseconds
99.69% <= 85 milliseconds
99.71% <= 86 milliseconds
99.74% <= 87 milliseconds
99.77% <= 88 milliseconds
99.79% <= 89 milliseconds
99.81% <= 90 milliseconds
99.83% <= 91 milliseconds
99.85% <= 92 milliseconds
99.88% <= 93 milliseconds
99.90% <= 94 milliseconds
99.92% <= 95 milliseconds
99.94% <= 96 milliseconds
99.96% <= 97 milliseconds
99.97% <= 98 milliseconds
99.99% <= 99 milliseconds
100.00% <= 100 milliseconds
100.00% <= 100 milliseconds
88791.38 requests per second

====== MSET (10 keys) ======
  1000390 requests completed in 3.75 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.01% <= 3 milliseconds
0.01% <= 16 milliseconds
0.80% <= 17 milliseconds
32.11% <= 18 milliseconds
67.13% <= 19 milliseconds
89.24% <= 20 milliseconds
96.67% <= 21 milliseconds
97.66% <= 22 milliseconds
97.67% <= 31 milliseconds
97.68% <= 32 milliseconds
97.79% <= 33 milliseconds
97.93% <= 34 milliseconds
98.19% <= 35 milliseconds
98.70% <= 36 milliseconds
99.10% <= 37 milliseconds
99.49% <= 38 milliseconds
99.64% <= 39 milliseconds
99.76% <= 40 milliseconds
99.84% <= 41 milliseconds
99.85% <= 42 milliseconds
99.85% <= 49 milliseconds
99.87% <= 50 milliseconds
99.95% <= 51 milliseconds
99.95% <= 52 milliseconds
100.00% <= 52 milliseconds
267055.53 requests per second